backend/load-tests/credential-retrieval.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 300  # 5 minutes
      arrivalRate: 200  # 200 requests per second
      name: "High load credential retrieval"
  processor: "./load-test-processor.js"
  
scenarios:
  - name: "Credential retrieval load test"
    weight: 80
    flow:
      # First register a user to get a DID
      - post:
          url: "/api/register"
          json:
            name: "{{ $randomString() }}"
            email: "{{ $randomString() }}@example.com"
          capture:
            - json: "$.data.did"
              as: "did"
            - json: "$.data.jwt"
              as: "jwt_token"
      
      # Then retrieve the credential
      - get:
          url: "/api/credentials/{{ did }}"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: data.did
  
  - name: "Audit logs retrieval"
    weight: 20
    flow:
      # Register and get JWT
      - post:
          url: "/api/register"
          json:
            name: "{{ $randomString() }}"
            email: "{{ $randomString() }}@example.com"
          capture:
            - json: "$.data.jwt"
              as: "jwt_token"
      
      # Retrieve audit logs
      - get:
          url: "/api/audit-logs?limit=10"
          headers:
            Authorization: "Bearer {{ jwt_token }}"
          expect:
            - statusCode: 200
            - contentType: json